content/_index.md
+++
title = "Home"
draft = false
[menu]
  [menu.main]
    weight = 1001
    identifier = "home"
+++

## About me {#about-me}

I am a software engineer.


## My work {#my-work}


### Greener {#greener}

I created [Greener](https://cephei8.github.io/greener/) - a platform for storing and viewing test results.

Repositories/subprojects:

-   [greener](https://github.com/cephei8/greener) - main repository
-   [greener-reporter](https://github.com/cephei8/greener-reporter) - native library for implementing test reporters
-   [greener-reporter-py](https://github.com/cephei8/greener-reporter-py) - Python package for implementing test reporters
-   [greener-reporter-js](https://github.com/cephei8/greener-reporter-js) - JavaScript package for implementing test reporters
-   [pytest-greener](https://github.com/cephei8/pytest-greener) - pytest plugin
-   [jest-greener](https://github.com/cephei8/jest-greener) - Jest reporter
